espressif/arduino-esp32/boards.txt
feathers2.menu.CPUFreq.240=240MHz (WiFi)
feathers2.menu.CPUFreq.240.build.f_cpu=240000000L
feathers2.menu.CPUFreq.160=160MHz (WiFi)
feathers2.menu.CPUFreq.160.build.f_cpu=160000000L
feathers2.menu.CPUFreq.80=80MHz (WiFi)
feathers2.menu.CPUFreq.80.build.f_cpu=80000000L
feathers2.menu.CPUFreq.40=40MHz
feathers2.menu.CPUFreq.40.build.f_cpu=40000000L
feathers2.menu.CPUFreq.20=20MHz
feathers2.menu.CPUFreq.20.build.f_cpu=20000000L
feathers2.menu.CPUFreq.10=10MHz
feathers2.menu.CPUFreq.10.build.f_cpu=10000000L

feathers2.menu.FlashSize.16M=16MB (128Mb)
feathers2.menu.FlashSize.16M.build.flash_size=16MB
feathers2.menu.FlashSize.4M=4MB (32Mb)
feathers2.menu.FlashSize.4M.build.flash_size=4MB
feathers2.menu.FlashSize.8M=8MB (64Mb)
feathers2.menu.FlashSize.8M.build.flash_size=8MB
feathers2.menu.FlashSize.8M.build.partitions=default_8MB
feathers2.menu.FlashSize.2M=2MB (16Mb)
feathers2.menu.FlashSize.2M.build.flash_size=2MB
feathers2.menu.FlashSize.2M.build.partitions=minimal

feathers2.menu.UploadSpeed.921600=921600
feathers2.menu.UploadSpeed.921600.upload.speed=921600
feathers2.menu.UploadSpeed.115200=115200
feathers2.menu.UploadSpeed.115200.upload.speed=115200
feathers2.menu.UploadSpeed.256000.windows=256000
feathers2.menu.UploadSpeed.256000.upload.speed=256000
feathers2.menu.UploadSpeed.230400.windows.upload.speed=256000
feathers2.menu.UploadSpeed.230400=230400
feathers2.menu.UploadSpeed.230400.upload.speed=230400
feathers2.menu.UploadSpeed.460800.linux=460800
feathers2.menu.UploadSpeed.460800.macosx=460800
feathers2.menu.UploadSpeed.460800.upload.speed=460800

feathers2.menu.DebugLevel.none=None
feathers2.menu.DebugLevel.none.build.code_debug=0
feathers2.menu.DebugLevel.error=Error
feathers2.menu.DebugLevel.error.build.code_debug=1
feathers2.menu.DebugLevel.warn=Warn
feathers2.menu.DebugLevel.warn.build.code_debug=2
feathers2.menu.DebugLevel.info=Info
feathers2.menu.DebugLevel.info.build.code_debug=3
feathers2.menu.DebugLevel.debug=Debug
feathers2.menu.DebugLevel.debug.build.code_debug=4
feathers2.menu.DebugLevel.verbose=Verbose
feathers2.menu.DebugLevel.verbose.build.code_debug=5

##############################################################
pros2.name=UM ProS2
pros2.vid.0=0x239A
pros2.pid.0=0x80A9

pros2.upload.tool=esptool_py
pros2.upload.maximum_size=1310720
pros2.upload.maximum_data_size=327680
pros2.upload.flags=

pros2.serial.disableDTR=false
pros2.serial.disableRTS=false

pros2.build.mcu=esp32s2
pros2.build.core=esp32
pros2.build.variant=um_pros2
pros2.build.board=PROS2

pros2.build.serial=1
pros2.build.f_cpu=240000000L
pros2.build.flash_size=16MB
pros2.build.flash_freq=80m
pros2.build.flash_mode=dio
pros2.build.boot=qio
pros2.build.partitions=fatflash
pros2.build.defines=

pros2.menu.SerialMode.cdc=USB CDC
pros2.menu.SerialMode.cdc.build.serial=1
pros2.menu.SerialMode.default=UART0
pros2.menu.SerialMode.default.build.serial=0

pros2.menu.PSRAM.enabled=Enabled
pros2.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
pros2.menu.PSRAM.disabled=Disabled
pros2.menu.PSRAM.disabled.build.defines=

pros2.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
pros2.menu.PartitionScheme.fatflash.build.partitions=ffat
pros2.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
pros2.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9MB FATFS)
pros2.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
pros2.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
pros2.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
pros2.menu.PartitionScheme.default.build.partitions=default
pros2.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
pros2.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
pros2.menu.PartitionScheme.default_8MB=8M Flash (3MB APP/1.5MB FAT)
pros2.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
pros2.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
pros2.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
pros2.menu.PartitionScheme.minimal.build.partitions=minimal
pros2.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
pros2.menu.PartitionScheme.no_ota.build.partitions=no_ota
pros2.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
pros2.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
pros2.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
pros2.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
pros2.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
pros2.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
pros2.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
pros2.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
pros2.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
pros2.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
pros2.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
pros2.menu.PartitionScheme.huge_app.build.partitions=huge_app
pros2.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
pros2.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
pros2.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
pros2.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

pros2.menu.CPUFreq.240=240MHz (WiFi)
pros2.menu.CPUFreq.240.build.f_cpu=240000000L
pros2.menu.CPUFreq.160=160MHz (WiFi)
pros2.menu.CPUFreq.160.build.f_cpu=160000000L
pros2.menu.CPUFreq.80=80MHz (WiFi)
pros2.menu.CPUFreq.80.build.f_cpu=80000000L
pros2.menu.CPUFreq.40=40MHz
pros2.menu.CPUFreq.40.build.f_cpu=40000000L
pros2.menu.CPUFreq.20=20MHz
pros2.menu.CPUFreq.20.build.f_cpu=20000000L
pros2.menu.CPUFreq.10=10MHz
pros2.menu.CPUFreq.10.build.f_cpu=10000000L

pros2.menu.FlashSize.16M=16MB (128Mb)
pros2.menu.FlashSize.16M.build.flash_size=16MB
pros2.menu.FlashSize.4M=4MB (32Mb)
pros2.menu.FlashSize.4M.build.flash_size=4MB
pros2.menu.FlashSize.8M=8MB (64Mb)
pros2.menu.FlashSize.8M.build.flash_size=8MB
pros2.menu.FlashSize.8M.build.partitions=default_8MB
pros2.menu.FlashSize.2M=2MB (16Mb)
pros2.menu.FlashSize.2M.build.flash_size=2MB
pros2.menu.FlashSize.2M.build.partitions=minimal

