espressif/arduino-esp32/boards.txt
##############################################################

vintlabs-devkit-v1.name=VintLabs ESP32 Devkit

vintlabs-devkit-v1.upload.tool=esptool_py
vintlabs-devkit-v1.upload.maximum_size=1310720
vintlabs-devkit-v1.upload.maximum_data_size=327680
vintlabs-devkit-v1.upload.flags=

vintlabs-devkit-v1.serial.disableDTR=true
vintlabs-devkit-v1.serial.disableRTS=true

vintlabs-devkit-v1.build.mcu=esp32
vintlabs-devkit-v1.build.core=esp32
vintlabs-devkit-v1.build.variant=vintlabsdevkitv1
vintlabs-devkit-v1.build.board=ESP32_DEV

vintlabs-devkit-v1.build.f_cpu=240000000L
vintlabs-devkit-v1.build.flash_mode=dio
vintlabs-devkit-v1.build.flash_size=4MB
vintlabs-devkit-v1.build.boot=dio
vintlabs-devkit-v1.build.partitions=default
vintlabs-devkit-v1.build.defines=

vintlabs-devkit-v1.menu.FlashFreq.80=80MHz
vintlabs-devkit-v1.menu.FlashFreq.80.build.flash_freq=80m
vintlabs-devkit-v1.menu.FlashFreq.40=40MHz
vintlabs-devkit-v1.menu.FlashFreq.40.build.flash_freq=40m

vintlabs-devkit-v1.menu.UploadSpeed.2000000=2000000
vintlabs-devkit-v1.menu.UploadSpeed.2000000.upload.speed=2000000
vintlabs-devkit-v1.menu.UploadSpeed.921600=921600
vintlabs-devkit-v1.menu.UploadSpeed.921600.upload.speed=921600
vintlabs-devkit-v1.menu.UploadSpeed.115200=115200
vintlabs-devkit-v1.menu.UploadSpeed.115200.upload.speed=115200
vintlabs-devkit-v1.menu.UploadSpeed.256000.windows=256000
vintlabs-devkit-v1.menu.UploadSpeed.256000.upload.speed=256000
vintlabs-devkit-v1.menu.UploadSpeed.230400.windows.upload.speed=256000
vintlabs-devkit-v1.menu.UploadSpeed.230400=230400
vintlabs-devkit-v1.menu.UploadSpeed.230400.upload.speed=230400
vintlabs-devkit-v1.menu.UploadSpeed.460800.linux=460800
vintlabs-devkit-v1.menu.UploadSpeed.460800.macosx=460800
vintlabs-devkit-v1.menu.UploadSpeed.460800.upload.speed=460800
vintlabs-devkit-v1.menu.UploadSpeed.512000.windows=512000
vintlabs-devkit-v1.menu.UploadSpeed.512000.upload.speed=512000

vintlabs-devkit-v1.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
vintlabs-devkit-v1.menu.PartitionScheme.default.build.partitions=default
vintlabs-devkit-v1.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
vintlabs-devkit-v1.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
vintlabs-devkit-v1.menu.PartitionScheme.default_8MB=8M Flash (3MB APP/1.5MB FAT)
vintlabs-devkit-v1.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
vintlabs-devkit-v1.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
vintlabs-devkit-v1.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
vintlabs-devkit-v1.menu.PartitionScheme.minimal.build.partitions=minimal
vintlabs-devkit-v1.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
vintlabs-devkit-v1.menu.PartitionScheme.no_ota.build.partitions=no_ota
vintlabs-devkit-v1.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
vintlabs-devkit-v1.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
vintlabs-devkit-v1.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
vintlabs-devkit-v1.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
vintlabs-devkit-v1.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
vintlabs-devkit-v1.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
vintlabs-devkit-v1.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
vintlabs-devkit-v1.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
vintlabs-devkit-v1.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
vintlabs-devkit-v1.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
vintlabs-devkit-v1.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
vintlabs-devkit-v1.menu.PartitionScheme.huge_app.build.partitions=huge_app
vintlabs-devkit-v1.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
vintlabs-devkit-v1.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
vintlabs-devkit-v1.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
vintlabs-devkit-v1.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
vintlabs-devkit-v1.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
vintlabs-devkit-v1.menu.PartitionScheme.fatflash.build.partitions=ffat
vintlabs-devkit-v1.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
vintlabs-devkit-v1.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9MB FATFS)
vintlabs-devkit-v1.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
vintlabs-devkit-v1.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728

vintlabs-devkit-v1.menu.FlashSize.4M=4MB (32Mb)
vintlabs-devkit-v1.menu.FlashSize.4M.build.flash_size=4MB
vintlabs-devkit-v1.menu.FlashSize.8M=8MB (64Mb)
vintlabs-devkit-v1.menu.FlashSize.8M.build.flash_size=8MB
vintlabs-devkit-v1.menu.FlashSize.8M.build.partitions=default_8MB
vintlabs-devkit-v1.menu.FlashSize.2M=2MB (16Mb)
vintlabs-devkit-v1.menu.FlashSize.2M.build.flash_size=2MB
vintlabs-devkit-v1.menu.FlashSize.2M.build.partitions=minimal
vintlabs-devkit-v1.menu.FlashSize.16M=16MB (128Mb)
vintlabs-devkit-v1.menu.FlashSize.16M.build.flash_size=16MB

vintlabs-devkit-v1.menu.DebugLevel.none=None
vintlabs-devkit-v1.menu.DebugLevel.none.build.code_debug=0
vintlabs-devkit-v1.menu.DebugLevel.error=Error
vintlabs-devkit-v1.menu.DebugLevel.error.build.code_debug=1
vintlabs-devkit-v1.menu.DebugLevel.warn=Warn
vintlabs-devkit-v1.menu.DebugLevel.warn.build.code_debug=2
vintlabs-devkit-v1.menu.DebugLevel.info=Info
vintlabs-devkit-v1.menu.DebugLevel.info.build.code_debug=3
vintlabs-devkit-v1.menu.DebugLevel.debug=Debug
vintlabs-devkit-v1.menu.DebugLevel.debug.build.code_debug=4

##############################################################

honeylemon.name=HONEYLemon

honeylemon.upload.tool=esptool_py
honeylemon.upload.maximum_size=1310720
honeylemon.upload.maximum_data_size=327680
honeylemon.upload.flags=

honeylemon.serial.disableDTR=true
honeylemon.serial.disableRTS=true

honeylemon.build.mcu=esp32
honeylemon.build.core=esp32
honeylemon.build.variant=honeylemon
honeylemon.build.board=HONEYLEMON

honeylemon.build.f_cpu=240000000L
honeylemon.build.flash_mode=dio
honeylemon.build.flash_size=4MB
honeylemon.build.boot=dio
honeylemon.build.partitions=default
honeylemon.build.defines=

